In [9]:
 # concatinate dataframe verticaly

import pandas as pd
data1={'name':['vasu','sugu','dhamu'],
      'age':[19,18,17],
      'team':['FCB','MU','RM']}
df1=pd.DataFrame(data1)
data2={'name':['babu','satheesh','mani'],
      'age':[19,18,17],
      'team':['FCB','MU','RM']}
df2=pd.DataFrame(data2)
concatinated=pd.concat([df1,df2],ignore_index=True)
display(concatinated)

       name  age team
0      vasu   19  FCB
1      sugu   18   MU
2     dhamu   17   RM
3      babu   19  FCB
4  satheesh   18   MU
5      mani   17   RM

In [3]:
 # concatinate dataframe horizontaly
import pandas as pd
data1={'name':['vasu','sugu','dhamu'],
        'age':[19,18,17]}
df1=pd.DataFrame(data1)
data2={'height':[5.5,6.8,7.0],
       'weight':[50,77,90]}
df2=pd.DataFrame(data2)
concatinated=pd.concat([df1,df2],axis=1)
display(concatinated)

    name  age  height  weight
0   vasu   19     5.5      50
1   sugu   18     6.8      77
2  dhamu   17     7.0      90

In [4]:
import pandas as pd
data1={'name':['vasu','sugu','dhamu'],
      'age':[19,18,17],
      'team':['FCB','MU','RM']}
df1=pd.DataFrame(data1)
data2={'name':['babu','satheesh','mani'],
      'age':[19,18,17],
      'team':['FCB','MU','RM']}
df2=pd.DataFrame(data2)
concatinated=pd.concat([df1,df2],ignore_index=True)
display(concatinated)

       name  age team
0      vasu   19  FCB
1      sugu   18   MU
2     dhamu   17   RM
3      babu   19  FCB
4  satheesh   18   MU
5      mani   17   RM

In [1]:
#concatinate with diff index
import pandas as pd
data1={'name':['vasu','sugu','dhamu'],          
        'age':[19,18,17]}
df1=pd.DataFrame(data1,index=[1,2,3])
data2={'height':[5.5,6.8,7.0]}
df2=pd.DataFrame(data1,index=[5,6,7])
concatinated=pd.concat([df1,df2])
display(concatinated)

    name  age
1   vasu   19
2   sugu   18
3  dhamu   17
5   vasu   19
6   sugu   18
7  dhamu   17

In [2]:
# merging two dataframe on a common column(inner join)
import pandas as pd
data1={'Team':['FCB','MU','RM','JUVE'],
       'Points':[25,22,12,10]}
data1=pd.DataFrame(data1)
data2={'Team':['FCB','MU','MC','PSG'],
       'Ranks':[1,10,2,9]}
data2=pd.DataFrame(data2)
merged_df=pd.merge(data1,data2,on='Team',how='inner')
print(merged_df)

  Team  Points  Ranks
0  FCB      25      1
1   MU      22     10

In [3]:
#6.	Merging with an Outer Join:
import pandas as pd
data1={'Team':['FCB','MU','RM','JUVE'],
       'Points':[25,22,12,10]}
data1=pd.DataFrame(data1)
data2={'Team':['FCB','MU','MC','PSG'],
       'Ranks':[1,10,2,9]}
data2=pd.DataFrame(data2)
merged_df=pd.merge(data1,data2,on='Team',how='outer')
print(merged_df)

   Team  Points  Ranks
0   FCB    25.0    1.0
1  JUVE    10.0    NaN
2    MC     NaN    2.0
3    MU    22.0   10.0
4   PSG     NaN    9.0
5    RM    12.0    NaN

In [4]:
#7.	Merging with a Left Join:
import pandas as pd
data1={'Team':['FCB','MU','RM','JUVE'],
       'Points':[25,22,12,10]}
data1=pd.DataFrame(data1)
data2={'Team':['FCB','MU','MC','PSG'],
       'Ranks':[1,10,2,9]}
data2=pd.DataFrame(data2)
merged_df=pd.merge(data1,data2,on='Team',how='left')
print(merged_df)

   Team  Points  Ranks
0   FCB      25    1.0
1    MU      22   10.0
2    RM      12    NaN
3  JUVE      10    NaN

In [5]:
#8.	Merging with a Right Join:
import pandas as pd
data1={'Team':['FCB','MU','RM','JUVE'],
       'Points':[25,22,12,10]}
data1=pd.DataFrame(data1)
data2={'Team':['FCB','MU','MC','PSG'],
       'Ranks':[1,10,2,9]}
data2=pd.DataFrame(data2)
merged_df=pd.merge(data1,data2,on='Team',how='right')
print(merged_df)

  Team  Points  Ranks
0  FCB    25.0      1
1   MU    22.0     10
2   MC     NaN      2
3  PSG     NaN      9